[Killed] StringLiteral
src/key-metrics.ts:13:3
   "largest-contentful-paint",
   "interactive",
   "speed-index",
-  "total-blocking-time",
+  "",
 ];
 
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts

  getKeyMetrics

[Killed] BlockStatement
src/key-metrics.ts:20:24
 
 export function getKeyMetrics(
   audits: Record<string, unknown>
-): Partial<KeyMetrics> {
-  const keyMetrics: Partial<KeyMetrics> = {};
-  for (const auditName of auditNames) {
-    const audit = audits[auditName] as { displayValue: string } | undefined;
-    if (!audit) {
-      continue;
-    }
-    const displayValue = audit.displayValue;
-    if (displayValue) {
-      keyMetrics[auditName] = displayValue;
-    }
-  }
-  return keyMetrics;
-}
+): Partial<KeyMetrics> {}
 
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts

  getKeyMetrics

[Killed] BlockStatement
src/key-metrics.ts:22:39
   audits: Record<string, unknown>
 ): Partial<KeyMetrics> {
   const keyMetrics: Partial<KeyMetrics> = {};
-  for (const auditName of auditNames) {
-    const audit = audits[auditName] as { displayValue: string } | undefined;
-    if (!audit) {
-      continue;
-    }
-    const displayValue = audit.displayValue;
-    if (displayValue) {
-      keyMetrics[auditName] = displayValue;
-    }
-  }
+  for (const auditName of auditNames) {}
   return keyMetrics;
 }
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts

  getKeyMetrics

[Killed] BlockStatement
src/key-metrics.ts:24:17
   const keyMetrics: Partial<KeyMetrics> = {};
   for (const auditName of auditNames) {
     const audit = audits[auditName] as { displayValue: string } | undefined;
-    if (!audit) {
-      continue;
-    }
+    if (!audit) {}
     const displayValue = audit.displayValue;
     if (displayValue) {
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts
  getKeyMetrics
    √ should extract key metrics from valid audit objects (11 ms)
    × should return partial results when some audits are missing (1 ms)

[Killed] ConditionalExpression
src/key-metrics.ts:24:9
   const keyMetrics: Partial<KeyMetrics> = {};
   for (const auditName of auditNames) {
     const audit = audits[auditName] as { displayValue: string } | undefined;
-    if (!audit) {
+    if (true) {
       continue;
     }
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts
  getKeyMetrics
    × should extract key metrics from valid audit objects (12 ms)
    × should return partial results when some audits are missing (2 ms)

[Killed] BlockStatement
src/key-metrics.ts:28:23
       continue;
     }
     const displayValue = audit.displayValue;
-    if (displayValue) {
-      keyMetrics[auditName] = displayValue;
-    }
+    if (displayValue) {}
   }
   return keyMetrics;
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts
  getKeyMetrics
    × should extract key metrics from valid audit objects (15 ms)
    × should return partial results when some audits are missing (3 ms)

[Killed] ConditionalExpression
src/key-metrics.ts:28:9
       continue;
     }
     const displayValue = audit.displayValue;
-    if (displayValue) {
+    if (false) {
       keyMetrics[auditName] = displayValue;
     }
killedBy: All tests
statusReason: > softtek_lighthouse@0.1.0 test
> jest


FAIL tests/key-metrics.test.ts

  getKeyMetrics
