[Survived] ObjectLiteral
src/main.ts:9:25
 import { getScores } from "./scores.ts";
 
 const port = 9222;
-const screenEmulation = {
-  mobile: false,
-  width: 1920,
-  height: 1080,
-  deviceScaleFactor: 1,
-  disabled: false,
-};
+const screenEmulation = {};
 const runAudit = async (targetUrl: string) => {
   console.log(`🔍 Opening browser for: ${targetUrl}`);

[Survived] BooleanLiteral
src/main.ts:10:11
 
 const port = 9222;
 const screenEmulation = {
-  mobile: false,
+  mobile: true,
   width: 1920,
   height: 1080,

[Survived] BooleanLiteral
src/main.ts:14:13
   width: 1920,
   height: 1080,
   deviceScaleFactor: 1,
-  disabled: false,
+  disabled: true,
 };
 const runAudit = async (targetUrl: string) => {

[Survived] BooleanLiteral
src/main.ts:19:15
 const runAudit = async (targetUrl: string) => {
   console.log(`🔍 Opening browser for: ${targetUrl}`);
   const browser = await puppeteer.launch({
-    headless: true,
+    headless: false,
     args: [`--remote-debugging-port=${port}`],
   });

[Survived] ObjectLiteral
src/main.ts:24:46
   });
 
   console.log(`⏳ Running audit...`);
-  const result = await lighthouse(targetUrl, {
-    port,
-    output: "json",
-    formFactor: "desktop",
-    disableFullPageScreenshot: true,
-    screenEmulation,
-  });
+  const result = await lighthouse(targetUrl, {});
 
   if (!result || !result.lhr) {

[Survived] BooleanLiteral
src/main.ts:28:32
     port,
     output: "json",
     formFactor: "desktop",
-    disableFullPageScreenshot: true,
+    disableFullPageScreenshot: false,
     screenEmulation,
   });

[Survived] BooleanLiteral
src/main.ts:32:7
     screenEmulation,
   });
 
-  if (!result || !result.lhr) {
+  if (result || !result.lhr) {
     console.error("❌ Lighthouse result is undefined");
     await browser.close();

[Survived] LogicalOperator
src/main.ts:32:7
     screenEmulation,
   });
 
-  if (!result || !result.lhr) {
+  if (!result && !result.lhr) {
     console.error("❌ Lighthouse result is undefined");
     await browser.close();

[Survived] OptionalChaining
src/main.ts:40:10
   const lhr: Partial<Result> = result.lhr;
 
   // Remove screenshots and other unnecessary data from the report
-  delete lhr.audits?.["screenshot-thumbnails"];
+  delete lhr.audits["screenshot-thumbnails"];
   delete lhr.audits?.["final-screenshot"];
   delete lhr.audits?.["full-page-screenshot"];

[Survived] OptionalChaining
src/main.ts:41:10
 
   // Remove screenshots and other unnecessary data from the report
   delete lhr.audits?.["screenshot-thumbnails"];
-  delete lhr.audits?.["final-screenshot"];
+  delete lhr.audits["final-screenshot"];
   delete lhr.audits?.["full-page-screenshot"];
   delete lhr.categoryGroups;

[Survived] OptionalChaining
src/main.ts:42:10
   // Remove screenshots and other unnecessary data from the report
   delete lhr.audits?.["screenshot-thumbnails"];
   delete lhr.audits?.["final-screenshot"];
-  delete lhr.audits?.["full-page-screenshot"];
+  delete lhr.audits["full-page-screenshot"];
   delete lhr.categoryGroups;
   delete lhr.configSettings;

[Survived] StringLiteral
src/main.ts:42:23
   // Remove screenshots and other unnecessary data from the report
   delete lhr.audits?.["screenshot-thumbnails"];
   delete lhr.audits?.["final-screenshot"];
-  delete lhr.audits?.["full-page-screenshot"];
+  delete lhr.audits?.[""];
   delete lhr.categoryGroups;
   delete lhr.configSettings;

[Survived] Regex
src/main.ts:49:47
   delete lhr.i18n;
   delete lhr.timing;
 
-  const reportPath = `tmp/${targetUrl.replace(/[^a-zA-Z0-9]/g, "-")}.json`;
+  const reportPath = `tmp/${targetUrl.replace(/[a-zA-Z0-9]/g, "-")}.json`;
   console.log(`📗 Writing report... ${reportPath}`);
   fs.writeFileSync(reportPath, JSON.stringify(lhr, null, 2), {

[Survived] StringLiteral
src/main.ts:52:15
   const reportPath = `tmp/${targetUrl.replace(/[^a-zA-Z0-9]/g, "-")}.json`;
   console.log(`📗 Writing report... ${reportPath}`);
   fs.writeFileSync(reportPath, JSON.stringify(lhr, null, 2), {
-    encoding: "utf-8",
+    encoding: "",
   });
   if (!lhr.categories) {

[Survived] BlockStatement
src/main.ts:54:24
   fs.writeFileSync(reportPath, JSON.stringify(lhr, null, 2), {
     encoding: "utf-8",
   });
-  if (!lhr.categories) {
-    console.error("❌ Lighthouse categories are undefined");
-    await browser.close();
-    return;
-  }
+  if (!lhr.categories) {}
   console.group(`📄 Scores:`);
   const scores = getScores(lhr.categories);

[Survived] BooleanLiteral
src/main.ts:54:7
   fs.writeFileSync(reportPath, JSON.stringify(lhr, null, 2), {
     encoding: "utf-8",
   });
-  if (!lhr.categories) {
+  if (lhr.categories) {
     console.error("❌ Lighthouse categories are undefined");
     await browser.close();

[Survived] StringLiteral
src/main.ts:55:19
     encoding: "utf-8",
   });
   if (!lhr.categories) {
-    console.error("❌ Lighthouse categories are undefined");
+    console.error("");
     await browser.close();
     return;

[Survived] StringLiteral
src/main.ts:59:17
     await browser.close();
     return;
   }
-  console.group(`📄 Scores:`);
+  console.group(``;
   const scores = getScores(lhr.categories);
 

[Survived] BlockStatement
src/main.ts:62:54
   console.group(`📄 Scores:`);
   const scores = getScores(lhr.categories);
 
-  for (const [key, value] of Object.entries(scores)) {
-    if (value.score < value.threshold) {
-      console.error(
-        `❌ ${key.toUpperCase()}: ${value.score} < ${value.threshold}`
-      );
-    } else {
-      console.log(
-        `✅ ${key.toUpperCase()}: ${value.score} > ${value.threshold}`
-      );
-    }
-  }
+  for (const [key, value] of Object.entries(scores)) {}
   console.groupEnd();
 

[Survived] EqualityOperator
src/main.ts:63:9
   const scores = getScores(lhr.categories);
 
   for (const [key, value] of Object.entries(scores)) {
-    if (value.score < value.threshold) {
+    if (value.score <= value.threshold) {
       console.error(
         `❌ ${key.toUpperCase()}: ${value.score} < ${value.threshold}`

[Survived] EqualityOperator
src/main.ts:63:9
   const scores = getScores(lhr.categories);
 
   for (const [key, value] of Object.entries(scores)) {
-    if (value.score < value.threshold) {
+    if (value.score >= value.threshold) {
       console.error(
         `❌ ${key.toUpperCase()}: ${value.score} < ${value.threshold}`

[Survived] MethodExpression
src/main.ts:65:14
   for (const [key, value] of Object.entries(scores)) {
     if (value.score < value.threshold) {
       console.error(
-        `❌ ${key.toUpperCase()}: ${value.score} < ${value.threshold}`
+        `❌ ${key.toLowerCase()}: ${value.score} < ${value.threshold}`
       );
     } else {

[Survived] BlockStatement
src/main.ts:67:12
       console.error(
         `❌ ${key.toUpperCase()}: ${value.score} < ${value.threshold}`
       );
-    } else {
-      console.log(
-        `✅ ${key.toUpperCase()}: ${value.score} > ${value.threshold}`
-      );
-    }
+    } else {}
   }
   console.groupEnd();

[Survived] MethodExpression
src/main.ts:69:14
       );
     } else {
       console.log(
-        `✅ ${key.toUpperCase()}: ${value.score} > ${value.threshold}`
+        `✅ ${key.toLowerCase()}: ${value.score} > ${value.threshold}`
       );
     }

[Survived] StringLiteral
src/main.ts:69:9
       );
     } else {
       console.log(
-        `✅ ${key.toUpperCase()}: ${value.score} > ${value.threshold}`
+        ``
       );
     }

[Survived] ConditionalExpression
src/main.ts:75:7
   }
   console.groupEnd();
 
-  if (!lhr.audits) {
+  if (false) {
     console.error("❌ Lighthouse audits are undefined");
     await browser.close();

[Survived] BlockStatement
src/main.ts:75:20
   }
   console.groupEnd();
 
-  if (!lhr.audits) {
-    console.error("❌ Lighthouse audits are undefined");
-    await browser.close();
-    return;
-  }
+  if (!lhr.audits) {}
   console.group(`📄 Key metrics:`);
   const keyMetrics = getKeyMetrics(lhr.audits);

[Survived] StringLiteral
src/main.ts:76:19
   console.groupEnd();
 
   if (!lhr.audits) {
-    console.error("❌ Lighthouse audits are undefined");
+    console.error("");
     await browser.close();
     return;

[Survived] BlockStatement
src/main.ts:82:58
   }
   console.group(`📄 Key metrics:`);
   const keyMetrics = getKeyMetrics(lhr.audits);
-  for (const [key, value] of Object.entries(keyMetrics)) {
-    console.log(`🚀 ${key.toUpperCase()}: ${value}`);
-  }
+  for (const [key, value] of Object.entries(keyMetrics)) {}
   console.groupEnd();
   console.log(`🤗 Closing browser...`);

[Survived] MethodExpression
src/main.ts:83:23
   console.group(`📄 Key metrics:`);
   const keyMetrics = getKeyMetrics(lhr.audits);
   for (const [key, value] of Object.entries(keyMetrics)) {
-    console.log(`🚀 ${key.toUpperCase()}: ${value}`);
+    console.log(`🚀 ${kkey.toLowerCase(): ${value}`);
   }
   console.groupEnd();

[Survived] StringLiteral
src/main.ts:86:15
     console.log(`🚀 ${key.toUpperCase()}: ${value}`);
   }
   console.groupEnd();
-  console.log(`🤗 Closing browser...`);
+  console.log(``;
   await browser.close();
 };

[Survived] BlockStatement
src/main.ts:91:11
 };
 
 const url = process.argv[2];
-if (!url) {
-  console.error(
-    "⚠️ Provide a URL as argument. npm start https://www.google.com"
-  );
-  process.exit(1);
-}
+if (!url) {}
 
 runAudit(url).catch((err) => {

[Survived] ConditionalExpression
src/main.ts:91:5
 };
 
 const url = process.argv[2];
-if (!url) {
+if (true) {
   console.error(
     "⚠️ Provide a URL as argument. npm start https://www.google.com"

[Survived] BlockStatement
src/main.ts:98:30
   process.exit(1);
 }
 
-runAudit(url).catch((err) => {
-  console.error("Error running Lighthouse:", err);
-  process.exit(1);
-});
+runAudit(url).catch((err) => {});
 

[Survived] StringLiteral
src/main.ts:99:17
 }
 
 runAudit(url).catch((err) => {
-  console.error("Error running Lighthouse:", err);
+  console.error("", err);
   process.exit(1);
 });
