[Survived] ArrayDeclaration
src/scores.ts:4:39
 import type { Result } from "lighthouse";
 
 type CategoryName = 'performance' | 'accessibility' | 'seo' | 'best-practices';
-const categoryNames: CategoryName[] = ['performance', 'accessibility', 'seo', 'best-practices'];
+const categoryNames: CategoryName[] = [];
 
 type Score = { "score": number; "threshold": number };

[Survived] StringLiteral
src/scores.ts:4:55
 import type { Result } from "lighthouse";
 
 type CategoryName = 'performance' | 'accessibility' | 'seo' | 'best-practices';
-const categoryNames: CategoryName[] = ['performance', 'accessibility', 'seo', 'best-practices'];
+const categoryNames: CategoryName[] = ['performance', "", 'seo', 'best-practices'];
 
 type Score = { "score": number; "threshold": number };

[Survived] BlockStatement
src/scores.ts:17:89
 };
 
 
-export function getScores(categories: Record<string, Result.Category>): Partial<Scores> {
-  const scores: Partial<Scores> = {}
-  for (const categoryName of categoryNames) {
-    const category = categories[categoryName];
-    if (!category) {
-      continue;
-    }
-    const score = category.score ?? 0;
-    const threshold = thresholds[categoryName];
-    scores[categoryName] = {
-      "score": score ?? 0,
-      "threshold": threshold
-    };
-  }
-  return scores;
-}
+export function getScores(categories: Record<string, Result.Category>): Partial<Scores> {}

[Survived] BlockStatement
src/scores.ts:19:45
 
 export function getScores(categories: Record<string, Result.Category>): Partial<Scores> {
   const scores: Partial<Scores> = {}
-  for (const categoryName of categoryNames) {
-    const category = categories[categoryName];
-    if (!category) {
-      continue;
-    }
-    const score = category.score ?? 0;
-    const threshold = thresholds[categoryName];
-    scores[categoryName] = {
-      "score": score ?? 0,
-      "threshold": threshold
-    };
-  }
+  for (const categoryName of categoryNames) {}
   return scores;
 }

[Survived] BooleanLiteral
src/scores.ts:21:9
   const scores: Partial<Scores> = {}
   for (const categoryName of categoryNames) {
     const category = categories[categoryName];
-    if (!category) {
+    if (category) {
       continue;
     }

[Survived] BlockStatement
src/scores.ts:21:20
   const scores: Partial<Scores> = {}
   for (const categoryName of categoryNames) {
     const category = categories[categoryName];
-    if (!category) {
-      continue;
-    }
+    if (!category) {}
     const score = category.score ?? 0;
     const threshold = thresholds[categoryName];

[Survived] LogicalOperator
src/scores.ts:24:19
     if (!category) {
       continue;
     }
-    const score = category.score ?? 0;
+    const score = category.score && 0;
     const threshold = thresholds[categoryName];
     scores[categoryName] = {

[Survived] LogicalOperator
src/scores.ts:27:16
     const score = category.score ?? 0;
     const threshold = thresholds[categoryName];
     scores[categoryName] = {
-      "score": score ?? 0,
+      "score": score && 0,
       "threshold": threshold
     };
